<a href="https://colab.research.google.com/github/GNuSeekK/ICTCOG/blob/main/2_14_%5Bpandas%5D_%EC%9B%90_%ED%95%AB_%EC%9D%B8%EC%BD%94%EB%94%A9.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
filepath="/content/drive/MyDrive/ICTCOG 인공지능과정/Data/korean-idol.csv"
df = pd.read_csv(filepath)
df.head()

     이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수
0    지민  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260
1  지드래곤     빅뱅   YG  남자  1988-08-18  177.0   A   9916947
2  강다니엘    NaN  커넥트  남자  1996-12-10  180.0   A   8273745
3     뷔  방탄소년단  빅히트  남자  1995-12-30  178.0  AB   8073501
4    화사    마마무  RBW  여자  1995-07-23  162.1   A   7650928

머신러닝에는 수치형 데이터 밖에 사용할 수 없어요.

혈액형을 사용하고 싶어요.
```python
  {
    "A" : 0,
    "B" : 1,
    "O" : 2,
    "AB": 3
  }
```

In [3]:
blood_type_map = {
    "A": 0,
    "B": 1,
    "O": 2,
    "AB": 3
}

df['혈액형_code'] = df['혈액형'].map(blood_type_map)
df.head()

     이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수  혈액형_code
0    지민  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260         0
1  지드래곤     빅뱅   YG  남자  1988-08-18  177.0   A   9916947         0
2  강다니엘    NaN  커넥트  남자  1996-12-10  180.0   A   8273745         0
3     뷔  방탄소년단  빅히트  남자  1995-12-30  178.0  AB   8073501         3
4    화사    마마무  RBW  여자  1995-07-23  162.1   A   7650928         0

In [4]:
df['혈액형_code'].value_counts() # 값이 각각 몇 개가 있는지

0    7
2    4
3    2
1    2
Name: 혈액형_code, dtype: int64

머신러닝이란, 주어진 데이터로 부터 관계를 생성하고, 패턴을 파악하는 과정
* 혈액형_code 컬럼에 대해서도 관계를 파악하기 시작한다.
  * "B형"( 1 ) + "O형"( 2 ) = "AB형" ( 3 )
  * "O형"( 2 ) - "B형"( 1 ) = "B형" ( 1 )
* 혈액형의 종류의 개수인 4개의 컬럼을 새롭게 만들어 주고 1개마다 혈액형에 알맞는 위치의 데이터를 1로, 나머지 데이터는 0으로 만들어 준다.

|A|B|O|AB|
|:---:|:---:|:---:|:---:|
|1|0|0|0|
|0|1|0|0|
|0|0|0|1|

In [5]:
pd.get_dummies(df["혈액형"])

    A  AB  B  O
0   1   0  0  0
1   1   0  0  0
2   1   0  0  0
3   0   1  0  0
4   1   0  0  0
5   1   0  0  0
6   0   0  0  1
7   0   0  1  0
8   0   0  0  1
9   1   0  0  0
10  1   0  0  0
11  0   0  1  0
12  0   1  0  0
13  0   0  0  1
14  0   0  0  1

원 핫 인코딩 된 데이터를 다른 말로 더미 데이터라고도 한다.